# Module 8: Exploring Data 

After importing data, you should take the time to review the data you are working with. This includes: determining the properties of the dataset, the number of rows and columns, the names of all the columns, and what information your dataset contains.

In [1]:
## always start with importing the libraries you need! ## 

import pandas as pd

## new library ##

import numpy as np

## Importing Excel Data

In [2]:
## similar process with slightly different code

df = pd.read_excel("axisdata.xlsx")

df.head()

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jackie,Jackson,Trainee,F,32,Y,1,3
1,Mary,Patterson,Trainee,F,43,N,1,6
2,Tanya,Adams,Trainee,F,28,Y,1,2
3,Tanya,Henderson,Trainee,F,24,Y,1,5
4,Walter,Franklin,Trainee,M,25,Y,1,4

## Types of Variables (Columns)
    
Categorical variables are comprised of category or label values; these variables place individuals into one of several groups. Examples:

- Marital Status (married, single, divorced)
- Eye Color (brown, blue, green)
- Level of Education (elementary, high school, college)
    
Quantitative variables are comprised of numerical values and represent some kind of measurement. Examples:

- Height
- Age
- Income

In [3]:
df.head(2)

## which variables are categorical and which are numeric?

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jackie,Jackson,Trainee,F,32,Y,1,3
1,Mary,Patterson,Trainee,F,43,N,1,6

## Dataset Characteristics

In [4]:
## return a list of all dataset column names 

df.columns

Index(['Fname', 'Lname', 'Position', 'Gender', 'Hours Worked', 'SalesTraining',
       'Years Experience', 'Cars Sold'],
      dtype='object')

In [5]:
## return a list of all column names and the data type of each column

df.dtypes

Fname               object
Lname               object
Position            object
Gender              object
Hours Worked         int64
SalesTraining       object
Years Experience     int64
Cars Sold            int64
dtype: object

In [6]:
## return the number of columns and rows in the dataset

df.shape

(999, 8)

In [7]:
## preview the first 5 rows

df.head()

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jackie,Jackson,Trainee,F,32,Y,1,3
1,Mary,Patterson,Trainee,F,43,N,1,6
2,Tanya,Adams,Trainee,F,28,Y,1,2
3,Tanya,Henderson,Trainee,F,24,Y,1,5
4,Walter,Franklin,Trainee,M,25,Y,1,4

In [8]:
## preview the last 5 rows

df.tail()

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
994,Walter,Mulgrew,Senior Salesperson,M,40,Y,5,5
995,Veronica,Looner,Senior Salesperson,F,22,Y,5,4
996,Larry,Patterson,Senior Salesperson,M,29,N,5,3
997,Victor,Kane,Senior Salesperson,M,22,Y,5,4
998,Victoria,Rogers,Senior Salesperson,F,29,N,5,1

In [9]:
## return a summary of the dataset

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Fname             999 non-null    object
 1   Lname             999 non-null    object
 2   Position          999 non-null    object
 3   Gender            999 non-null    object
 4   Hours Worked      999 non-null    int64
 5   SalesTraining     999 non-null    object
 6   Years Experience  999 non-null    int64
 7   Cars Sold         999 non-null    int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [10]:
## return a summary of the numeric variables in dataset

df.describe()

       Hours Worked  Years Experience   Cars Sold
count    999.000000        999.000000  999.000000
mean      33.727728          3.026026    3.922923
std        8.223454          1.394709    1.527000
min       20.000000          1.000000    1.000000
25%       27.000000          2.000000    3.000000
50%       34.000000          3.000000    4.000000
75%       41.000000          4.000000    5.000000
max       48.000000          5.000000    7.000000

## { EXERCISE 1 }

1. Import the pokemon.csv file. Nickname the file "pk" and preview the first 5 rows.
2. Write the code to see the summary of the dataset.
3. Write the code to see the descriptive summary for the numeric variables in the dataset.

In [11]:
PK= pd.read_csv("pokemon.csv")

df.head()

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jackie,Jackson,Trainee,F,32,Y,1,3
1,Mary,Patterson,Trainee,F,43,N,1,6
2,Tanya,Adams,Trainee,F,28,Y,1,2
3,Tanya,Henderson,Trainee,F,24,Y,1,5
4,Walter,Franklin,Trainee,M,25,Y,1,4

In [12]:
df.describe()

       Hours Worked  Years Experience   Cars Sold
count    999.000000        999.000000  999.000000
mean      33.727728          3.026026    3.922923
std        8.223454          1.394709    1.527000
min       20.000000          1.000000    1.000000
25%       27.000000          2.000000    3.000000
50%       34.000000          3.000000    4.000000
75%       41.000000          4.000000    5.000000
max       48.000000          5.000000    7.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Fname             999 non-null    object
 1   Lname             999 non-null    object
 2   Position          999 non-null    object
 3   Gender            999 non-null    object
 4   Hours Worked      999 non-null    int64
 5   SalesTraining     999 non-null    object
 6   Years Experience  999 non-null    int64
 7   Cars Sold         999 non-null    int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

## Simple Descriptive Statistics

Descriptive statistics are used to describe a dataset. We will cover descriptive statistics in more detail later on, but there are a few simple statistics you can familiarize yourself with now.

In [14]:
# shows the maximum value of all columns

df.max()

Fname                 india
Lname               Withers
Position            Trainee
Gender                    M
Hours Worked             48
SalesTraining             Y
Years Experience          5
Cars Sold                 7
dtype: object

In [15]:
# shows the maximum value of the Hours Worked column

df["Hours Worked"].max()

48

In [16]:
# shows the maximum value of all columns

df.min()

Fname                            Aaron
Lname                            Adams
Position            Junior Salesperson
Gender                               F
Hours Worked                        20
SalesTraining                        N
Years Experience                     1
Cars Sold                            1
dtype: object

In [17]:
# shows the minimum value of the Hours Worked column

df["Hours Worked"].min()

20

In [18]:
# shows the sum of all values in the Hours Worked column

df["Hours Worked"].sum()

33694

In [19]:
# shows the average value of all columns

df.mean()

Hours Worked        33.727728
Years Experience     3.026026
Cars Sold            3.922923
dtype: float64

In [20]:
# shows the average value of the Hours Worked column

df["Hours Worked"].mean()

33.727727727727725

In [21]:
# shows the median value of all numeric columns
# the median is the central value when all values are in order of least to greatest

df.median()

Hours Worked        34.0
Years Experience     3.0
Cars Sold            4.0
dtype: float64

In [22]:
# shows the median value of the Hours Worked column

df["Hours Worked"].median()

34.0

In [23]:
# shows the mode of all numeric columns
# # the mode is the value or values that occur the most frequency, 
# there can be no mode if all values occur the same number of times

df.mode()

,Fname,Lname,Position,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Sam,Johnson,Junior Salesperson,M,38,Y,3,5

In [24]:
# shows the mode value of the Hours Worked column

df["Hours Worked"].mode()

0    38
dtype: int64

## Value Frequencies

Value counts/freq show how many individuals fall into a specific category. This is how we will explore our categorical variables.

In [25]:
df["Position"].value_counts()

Junior Salesperson    419
Senior Salesperson    397
Trainee               183
Name: Position, dtype: int64

In [26]:
df["Gender"].value_counts()

M    510
F    489
Name: Gender, dtype: int64

In [27]:
df["SalesTraining"].value_counts()

Y    586
N    413
Name: SalesTraining, dtype: int64

In [28]:
df["SalesTraining"].value_counts(normalize = True)

Y    0.586587
N    0.413413
Name: SalesTraining, dtype: float64

## { EXERCISE 2 }

1. Using the "pk" dataset you previously imported, determine the following information for the DEFENSE column:
    * Mean defense value
    * Min defense value
    * Max defense value
    * Sum defense value
    
    
2. Use the value counts function to determine how many pokemon fall into each of the following categories:
    * Type 1
    * Type 2
    * Stage
    * Legendary

In [29]:
pk["Defense"].mean()
pk["Defense"].min()
pk["Defense"].max()
pk["Defense"].sum()

NameError: name 'pk' is not defined

In [ ]:
pk["Type1"].value_counts()
pk["Type2"].value_counts()
pk["Stage"].value_counts()
pk["Legendary"].value_counts()

## Locating Data based on a Condition

You can use the .loc method to locate specific data within your dataset based on a specific condition of the data. When exploring data based on a condition, keep in mind the conditional statements that we discussed previously:

#### Conditional Symbols

    == (equal to)
    != (not equal to)
    > (greater than)
    < (less than)
    >= (greater than or equal to)
    <= (less than or equal to)
    & (and)
    | (or)

In [ ]:
## gender is Male

df.loc[df["Gender"] == "M"]

In [ ]:
## hours worked is 40

df.loc[df["Hours Worked"] == 40]

In [ ]:
## years experience is less than 2

df.loc[df["Years Experience"] < 2]

In [ ]:
## cars sold is greater than or equal to 3

df.loc[df["Cars Sold"] >= 3]

In [ ]:
## gender does not equal Male

df.loc[df["Gender"] != "M"]

## Locating Data Based on Multiple Conditions

You can also have the option of choosing multiple conditions to sift through your data. When using multiple conditions, pay attention to how the conditions relate to each other (i.e. do you want to see data where both conditions are true? do you want to see data where at least one condition is true?) - this is where you will need to implement the <b>and (&)</b> and <b>or (|)</b> options.

In [ ]:
## locate data where the individuals have no sales experience and sold over 4 cars

df.loc[(df["SalesTraining"] == "N") & (df["Cars Sold"] > 4)]

In [ ]:
## locate the data where years of experience is 1 or hours worked is less than 25

df.loc[(df["Years Experience"] == 1) | (df["Hours Worked"] < 25)]

In [ ]:
## adding in a third condition

df.loc[(df["SalesTraining"] == "N") & (df["Cars Sold"] > 4) & (df["Gender"] == "F")]

## { EXERCISE 3 }

1. Using the "pk" dataset, locate the data where STAGE is 1.
2. Using the "pk" dataset, locate the data where TYPE 1 is Fire.
3. Using the "pk" dataset, locate the data where SPEED is greater than 65.
4. Using the "pk" dataset, locate the data that meets the following conditions:
    * ATTACK is less than 60
    * STAGE is equal to 2
5. Using the "pk" dataset, locate the data that meets the following conditions:
    * TYPE 1 is equal to "Bug"
    * SPEED is greater than or equal to 50

In [ ]:
pk.loc[pk["STAGE"] ==1]

In [ ]:
pk.loc[pk["TYPE1"]=="Free"]

In [ ]:
pk.loc[PK["SPEED"] >65]

In [ ]:
pk.loc[(PK["ATTACK"]<60 )& (PK["STAGE"]== 2 )]

In [ ]:
pk.loc[(PK["TYPE1"]=="Bug" )& &(PK["SPEED"]>50 )]

## Crosstabs
    
To describe a single categorical variable, we use frequency tables (see above for value counts). To observe the relationship between two categorical variables, we use a cross-tabulation table (crosstab). With a crosstab, you can determine the frequency of observations across categories.

In [30]:
pd.crosstab(df["Position"], df["Gender"])

Gender                F    M
Position
Junior Salesperson  204  215
Senior Salesperson  200  197
Trainee              85   98

In [32]:
pd.crosstab(df["Position"], df["Gender"], margins=True)

Gender                F    M  All
Position
Junior Salesperson  204  215  419
Senior Salesperson  200  197  397
Trainee              85   98  183
All                 489  510  999

## Grouping Data

Grouping data allows you to summarize data in different ways, this may give you insight on how some variables interact with others. Using the groupby function, you will select a numeric variable to be summarized and then a categorical variable to group the numeric variable.    
    
    df[numeric variable].groupby(categorical variable).summarizing element

In [33]:
## Group by Sales Training; Summarize for Cars Sold

df["Cars Sold"].groupby(df["SalesTraining"]).mean()

SalesTraining
N    3.573850
Y    4.168942
Name: Cars Sold, dtype: float64

In [34]:
## Group by Gender; Summarize for Cars Sold

df["Cars Sold"].groupby(df["Gender"]).mean()

Gender
F    3.760736
M    4.078431
Name: Cars Sold, dtype: float64

In [35]:
## Group by Position; Summarize for Hours Worked

df["Hours Worked"].groupby(df["Position"]).mean()

Position
Junior Salesperson    34.066826
Senior Salesperson    33.692695
Trainee               33.027322
Name: Hours Worked, dtype: float64

In [36]:
## Grouping the entire dataset by a specific variable

df.groupby(df['SalesTraining']).mean()

               Hours Worked  Years Experience  Cars Sold
SalesTraining
N                 33.474576          3.055690   3.573850
Y                 33.906143          3.005119   4.168942

## { EXERCISE 4 }

1. Using the "pk" dataset, group your ATTACK variable by STAGE. Summarize this data by showing the mean attack across each stage.
2. Using the "pk" dataset, group your SPEED variable by TYPE 1. Summarize this data by showing the mean speed across each pokemon type. 
3. Using the "pk" dataset, group your DEFENSE variable by STAGE. Summarize this data by showing the mean defense across each stage.

# { Module 8 Homework }

1. Import the "Dental Patients.xlsx" file and nickname the dataset "df". Preview the first 10 rows. You need to complete this step to have access to the correct dataset!

In [ ]:
import pandas as pd

df = pd.read_excel("Dental Patients.xlsx")

df.head(10)

2. Write the code to preview the last 5 rows of the df dataset.

In [ ]:
df.tail(5)

3. Write the code to print the summary information for the df dataset. How many rows are there? How many columns?

In [ ]:
df.info()

4. Looking closer at the df dataset, what is the maximum age for this group of patients? What is the minimum age?

In [ ]:
df["Age"].max()

In [ ]:
df["Age"].min()

5. How much money is owned in total to the dental practice? Hint: find the sum of the "OutstandingBalance" column.

In [ ]:
df["OutstandingBalance"].sum()

6. Write the code below to determine how many new patients there are.

In [ ]:
df["NewPatient"].value_counts()

7. Write the code below to determine how many patients have any allergies.

In [ ]:
df["Allergies"].value_counts()

8. Let's select some data based on conditions. Find the data in the df dataset where "Gender" equals "F".

In [ ]:
df.loc[df["Gender"] == "F"]

In [ ]:
len(df.loc[df["Gender"] == "F"])

9. Find the data in the df dataset where "OutstandingBalance" equals 0. These are the people who have paid all of their bills!

In [ ]:
df.loc[df["OutstandingBalance"] == 0]

In [ ]:
len(df.loc[df["OutstandingBalance"] == 0])

10. Complete the code below to find the data in the df dataset where "NewPatient" equals "Y" and "Allergies" also equals "Y".

In [ ]:
.loc[(df["NewPatient"] == "Y") & (df["Allergies"] == "Y")]

11. Using the groupby function, group the df dataset by the "Insurance" variable and summarize for the "OutstandingBalance" variable. Use the mean.

12. Using the groupby function, group the df dataset by the "Gender" variable and summarize for the "Age" variable. Use the mean.